app/controllers/clients_controller.rb

INSERT INTO "users" ("name", "salt", "updated_at", "crypted_password", "remember_token_expires_at", "remember_token", "login", "email", "created_at") VALUES('', 'ad8c71d2f937d3b23da5b7162dd0e3d19494aaf2', '2009-04-03 17:01:21', 'd334a046052d814f1a2aa1e029a853a8395ddbb2', NULL, NULL, 'asdfoquwyr87', 'aojfhgqoeur@askdjfo.org', '2009-04-03 17:01:21')
INSERT INTO "clients" ("name", "updated_at", "user_id", "is_student", "created_at") VALUES(NULL, '2009-04-03 17:01:21', 33, 'f', '2009-04-03 17:01:21')
INSERT INTO "students" ("updated_at", "client_id", "user_id", "created_at") VALUES('2009-04-03 17:31:25', 20, 34, '2009-04-03 17:31:25')
---
  def create

    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
    if (! success) || (! @user.errors.empty?)
      flash[:error] = "We were unable to set up that account"
      render :action => 'new'
      return
    end

    @client = Client.new(params[:client])
    @client.user_id = @user.id
    success = @client && @client.save

    if (! success) || (! @client.errors.empty?)
      @user.delete
      flash[:error] = "We were unable to set up that account"
      render :action => 'new'
      return
    end

    @user.roles << Role[:client]

    if(@client.is_student)
      @student = Student.new()
      @student.user_id = @user.id
      @student.client_id = @client.id

      success = @student && @student.save

SELECT "users".id FROM "users" WHERE ("users"."login" = 'asdfoquwyr87') LIMIT 1
---
    task = WorkflowTask.new
    task.workflow_task_type = WorkflowTaskType[:initial_consultation]
    task.owner = User.find_by_login('admin')