app/controllers/misc_controller.rb

SELECT * FROM "workflow_tasks" WHERE ("workflow_tasks"."owner_id" = 22) LIMIT 1
---
  def homepage

    if(logged_in?)
      @pending_tasks = WorkflowTask.find_all_by_owner_id(current_user.id)