app/controllers/simple_workflow_tasks_controller.rb

  def complete_phone_consultation
    @task = WorkflowTask.find(params[:id])

    @newTask = @task.create_successor_task
    @newTask.workflow_task_type_id = WorkflowTaskType[:initial_interview]
    @newTask.save

    @task.delete
---
SELECT * FROM "workflow_tasks" WHERE ("workflow_tasks"."id" = 1)
INSERT INTO "workflow_tasks" ("updated_at", "target_id", "workflow_task_type_id", "owner_id", "created_at") VALUES('2009-03-31 18:08:18', 32, 2, 21, '2009-03-31 18:08:18')
DELETE FROM "workflow_tasks" WHERE ("id" IN (1))

  def complete_on_site_interview
    @task = WorkflowTask.find(params[:id])

    @task.delete
---
SELECT * FROM "workflow_tasks" WHERE ("workflow_tasks"."id" = 2)
DELETE FROM "workflow_tasks" WHERE ("id" IN (2))