app/controllers/students_controller.rb

INSERT INTO "users" ("name", "salt", "updated_at", "crypted_password", "remember_token_expires_at", "remember_token", "login", "email", "created_at") VALUES('', '221c66bb2205f00d700c9b1552c0f01dcb68e8ae', '2009-04-03 17:51:47', '879351cc603827fac5c57f94b2601a247b79d130', NULL, NULL, 'asdfoiuasdf', 'asdfoiu@aaoiu.org', '2009-04-03 17:51:47')
SELECT * FROM "clients" WHERE ("clients"."user_id" = '33') LIMIT 1
INSERT INTO "students" ("updated_at", "client_id", "user_id", "created_at") VALUES('2009-04-03 17:52:19', 19, 36, '2009-04-03 17:52:19')
---
  def create

    @user = User.new(params[:user])
    success = @user && @user.save
    if (! success) || (! @user.errors.empty?)
      flash[:error] = "We were unable to set up that account"
      render :action => 'new'
      return
    end


    # a client creates a child student, an admin
    # specifies one

    if( current_user.has_role? 'client' )
      @client = Client.find_by_user_id(current_user.id)
    end

    if( current_user.has_role? 'admin' )
      @client = Client.find_by_user_id(params[:student][:client_id])
    end


    @student = Student.new()
    @student.user_id = @user.id
    @student.client_id = @client.id

    success = @student && @student.save

SELECT "users".id FROM "users" WHERE ("users"."login" = 'asdfoiu') LIMIT 1
---
    task = WorkflowTask.new
    task.workflow_task_type_id = WorkflowTaskType::OnSiteInterviewId
    task.owner = User.find_by_login('admin')