app/controllers/tutors_controller.rb

  def home

    @tutor = Tutor.find_by_user_id(current_user.id)
---
SELECT * FROM "tutors" WHERE ("tutors"."user_id" = 20) LIMIT 1

  def show
    @tutor = Tutor.find(params[:id])
---
SELECT * FROM "tutors" WHERE ("tutors"."id" = 1)

  def create

    @user = User.new(params[:user])
    tutorRole = Role.find_by_name('tutor')
    @user.roles = [ tutorRole ]
    @user.save
---
SELECT * FROM "roles" WHERE ("roles"."name" = 'tutor') LIMIT 1
INSERT INTO "tutors" ("updated_at", "user_id", "created_at") VALUES('2009-03-27 19:26:47', 19, '2009-03-27 19:26:47')
INSERT INTO "users" ("name", "salt", "updated_at", "crypted_password", "remember_token_expires_at", "remember_token", "login", "email", "created_at") VALUES('', '3bba34680fc061d555036caf427176a42ed83604', '2009-03-25 20:06:57', '68bcbd70becb7c7855e2089c03a0651c824d3c42', NULL, NULL, 'yuio', 'yuio@lkjh.org', '2009-03-25 20:06:57')