app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO "users" ("name", "salt", "updated_at", "crypted_password", "remember_token_expires_at", "remember_token", "login", "email", "created_at") VALUES('', '6878feb27aaf77d48cdbb2c462e6f5e6f301daec', '2009-03-16 18:04:49', '5115fdea6b68861f9ccdc5ef438a8142c982cc42', NULL, NULL, 'nick', 'q@qwidjibo.org', '2009-03-16 18:04:49')

  def create_with_client_or_student

    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
    if (! success) || (! @user.errors.empty?)
      flash[:error] = "We were unable to set up that account"
      render :action => 'new_with_client_or_student'
      return
    end

    @client = Client.new(params[:client])
    @client.user_id = @user.id
    success = @client && @client.save

    if (! success) || (! @client.errors.empty?)
      @user.delete
      flash[:error] = "We were unable to set up that account"
      render :action => 'new_with_client_or_student'
      return
    end

    if(@client.is_student)
      @student = Student.new()
      @student.user_id = @user.id
      @student.client_id = @client.id

      success = @student && @student.save
---
INSERT INTO "users" ("name", "salt", "updated_at", "crypted_password", "remember_token_expires_at", "remember_token", "login", "email", "created_at") VALUES('', 'c34b03f9800d270856cfac1d4e66c574705c5a9f', '2009-03-25 19:03:11', 'b3508681aa9d114f3d8b871d7d7be8430fe3fe09', NULL, NULL, 'foo', 'foo@vbar.org', '2009-03-25 19:03:11')
SELECT * FROM "users"
INSERT INTO "clients" ("name", "updated_at", "user_id", "is_student", "created_at") VALUES(NULL, '2009-03-25 19:11:01', 5, NULL, '2009-03-25 19:11:01')
DELETE FROM "users" WHERE ("id" IN (3))
INSERT INTO "students" ("updated_at", "client_id", "user_id", "created_at") VALUES('2009-03-25 19:23:46', 9, 13, '2009-03-25 19:23:46')

    task = WorkflowTask.new
    task.workflow_task_type_id = WorkflowTaskType::PhoneConsultationId
    task.owner = User.find_by_login('admin')
---
SELECT "users".id FROM "users" WHERE ("users"."login" = 'foo') LIMIT 1