app/controllers/workflow_tasks_controller.rb

  def index
    @workflow_tasks = WorkflowTask.find(:all)
---
SELECT * FROM "workflow_tasks" WHERE ("workflow_tasks".owner_id = 20)